_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ПредопределенныеЭлементы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_ПредопределенныеЭлементы</Name>
			<Comment>Предопределенные элементы (УСО)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Список</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначенийСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ПредопределенныеЭлементы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьТипПредопределенногоЭлемента(ПредопределенныйЭлемент) Экспорт 
	
	СтруктураВозврата = Новый Структура("Тип,Список",Неопределено,Истина);
	
	Если НЕ ПредопределенныйЭлемент.Предопределенный Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;  
	
	ИмяПредопределенных = ПредопределенныйЭлемент.ИмяПредопределенныхДанных;
	
	Если ИмяПредопределенных = "СчетУчетаЗатратПоВыполнениюСтроительныхРабот" Тогда
		СтруктураВозврата.Тип =  Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");
		СтруктураВозврата.Список = Ложь;
	КонецЕсли;
	
	Если ИмяПредопределенных = "СчетУчетаОбъектовНедвижимости" Тогда
		СтруктураВозврата.Тип = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");
		СтруктураВозврата.Список = Ложь;
	КонецЕсли;
	
	Если ИмяПредопределенных = "СчетУчетаОбъектовНедвижимостиЗабаланс" Тогда
		СтруктураВозврата.Тип = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");
	КонецЕсли;
	
	Если ИмяПредопределенных = "СчетУчетаРасчетовПоЦелевомуФинансированию" Тогда
		СтруктураВозврата.Тип = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");
	КонецЕсли;
	
	Если ИмяПредопределенных ="СчетаРасчетовСДольщиками" Тогда
		СтруктураВозврата.Тип = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");
	КонецЕсли;
	
	Если ИмяПредопределенных ="СчетУчетаЗатратПоВыполнениюФункцийЗаказчикаЗастройщика" Тогда
		СтруктураВозврата.Тип = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");
		СтруктураВозврата.Список = Ложь;
	КонецЕсли; 
	
	Если ИмяПредопределенных ="ОтражениеНепредъявленнойВыручки" Тогда
		СтруктураВозврата.Тип = Новый ОписаниеТипов("СправочникСсылка.ГруппыФинансовогоУчетаНоменклатуры");
		СтруктураВозврата.Список = Ложь;
	КонецЕсли; 
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьМассивЗначенийПредопределенныхЭлементов(МассивЭлементов) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивЭлементов",МассивЭлементов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Значение
	|ИЗ
	|	(ВЫБРАТЬ
	|		УСОERP_ПредопределенныеЭлементы.Значение КАК Значение
	|	ИЗ
	|		Справочник.УСОERP_ПредопределенныеЭлементы КАК УСОERP_ПредопределенныеЭлементы
	|	ГДЕ
	|		УСОERP_ПредопределенныеЭлементы.Ссылка В(&МассивЭлементов)
	|		И НЕ УСОERP_ПредопределенныеЭлементы.Список
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УСОERP_ПредопределенныеЭлементыСписокЗначений.Значение
	|	ИЗ
	|		Справочник.УСОERP_ПредопределенныеЭлементы.СписокЗначений КАК УСОERP_ПредопределенныеЭлементыСписокЗначений
	|	ГДЕ
	|		УСОERP_ПредопределенныеЭлементыСписокЗначений.Ссылка В(&МассивЭлементов)
	|		И УСОERP_ПредопределенныеЭлементыСписокЗначений.Ссылка.Список) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Значение";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение");	
	
КонецФункции

#КонецОбласти

#КонецЕсли
